Repository: bestpractical/rt-extension-resetpassword
Catalog: po/*.po
Languages: de

source: Email address
de: E-Mail Adresse

source: Failed to send password reset token, please contact your RT administrator.
de: Fehler beim Passwort-Reset-Token senden, kontaktieren Sie bitte Ihren RT Administrator.

source: Forgot your password?
de: Passwort vergessen?

source: It looks like the URL you clicked on has expired or wasn't quite right. Maybe you didn't paste the whole thing?
de: Es sieht aus als wenn die URL, die Sie aufgerufen haben, abgelaufen war oder nicht ganz richtig war. Vielleicht haben Sie nicht die ganze URL einfügen?

source: RT can send you an email message with a link that will allow you to reset your password.
de: RT kann eine E-Mail mit einem Link senden, mit dem Sie Ihr Passwort zurücksetzen können.

source: RT couldn't find a user with that email address. Give it another try?
de: RT kann einen Benutzer mit dieser E-Mail-Adresse nicht finden. Nochmal versuchen?

source: RT has sent you an email message with instructions about how to reset your password
de: RT hat eine E-Mail gesendet mit Anweisungen wie Sie Ihr Passwort zurücksetzen können

source: Reset your password
de: Passwort zurücksetzen

source: Send it!
de: Senden!

source: Something went wrong. Please contact your RT administrator.
de: Irgendwas ist falsch gelaufen. Kontaktieren Sie bitte Ihren RT Administrator.

source: The two passwords you typed didn't match.
de: Die beiden von Ihnen eingegebenen Passwörter stimmen nicht überein.

source: You can't reset your password as you don't already have one.
de: Sie können ihr Passwort nicht zurücksetzen, da Sie noch keines haben.

source: You can't reset your password because your user is disabled.
de: Sie können ihr Passwort nicht zurücksetzen, da ihr Benutzer deaktiviert ist.
